set_input_delay 0 -min -rise [get_ports nid20]
set_input_delay 0 -min -fall [get_ports nid20]
set_input_delay 0 -max -rise [get_ports nid20]
set_input_delay 0 -max -fall [get_ports nid20]
set_input_transition 5 -min -rise [get_ports nid20]
set_input_transition 5 -min -fall [get_ports nid20]
set_input_transition 5 -max -rise [get_ports nid20]
set_input_transition 5 -max -fall [get_ports nid20]
set_input_delay 0 -min -rise [get_ports nid6]
set_input_delay 0 -min -fall [get_ports nid6]
set_input_delay 0 -max -rise [get_ports nid6]
set_input_delay 0 -max -fall [get_ports nid6]
set_input_transition 5 -min -rise [get_ports nid6]
set_input_transition 5 -min -fall [get_ports nid6]
set_input_transition 5 -max -rise [get_ports nid6]
set_input_transition 5 -max -fall [get_ports nid6]
set_input_delay 0 -min -rise [get_ports nid21]
set_input_delay 0 -min -fall [get_ports nid21]
set_input_delay 0 -max -rise [get_ports nid21]
set_input_delay 0 -max -fall [get_ports nid21]
set_input_transition 5 -min -rise [get_ports nid21]
set_input_transition 5 -min -fall [get_ports nid21]
set_input_transition 5 -max -rise [get_ports nid21]
set_input_transition 5 -max -fall [get_ports nid21]
set_input_delay 0 -min -rise [get_ports nic7]
set_input_delay 0 -min -fall [get_ports nic7]
set_input_delay 0 -max -rise [get_ports nic7]
set_input_delay 0 -max -fall [get_ports nic7]
set_input_transition 5 -min -rise [get_ports nic7]
set_input_transition 5 -min -fall [get_ports nic7]
set_input_transition 5 -max -rise [get_ports nic7]
set_input_transition 5 -max -fall [get_ports nic7]
set_input_delay 0 -min -rise [get_ports nid0]
set_input_delay 0 -min -fall [get_ports nid0]
set_input_delay 0 -max -rise [get_ports nid0]
set_input_delay 0 -max -fall [get_ports nid0]
set_input_transition 5 -min -rise [get_ports nid0]
set_input_transition 5 -min -fall [get_ports nid0]
set_input_transition 5 -max -rise [get_ports nid0]
set_input_transition 5 -max -fall [get_ports nid0]
set_input_delay 0 -min -rise [get_ports nid11]
set_input_delay 0 -min -fall [get_ports nid11]
set_input_delay 0 -max -rise [get_ports nid11]
set_input_delay 0 -max -fall [get_ports nid11]
set_input_transition 5 -min -rise [get_ports nid11]
set_input_transition 5 -min -fall [get_ports nid11]
set_input_transition 5 -max -rise [get_ports nid11]
set_input_transition 5 -max -fall [get_ports nid11]
set_input_delay 0 -min -rise [get_ports nid13]
set_input_delay 0 -min -fall [get_ports nid13]
set_input_delay 0 -max -rise [get_ports nid13]
set_input_delay 0 -max -fall [get_ports nid13]
set_input_transition 5 -min -rise [get_ports nid13]
set_input_transition 5 -min -fall [get_ports nid13]
set_input_transition 5 -max -rise [get_ports nid13]
set_input_transition 5 -max -fall [get_ports nid13]
set_input_delay 0 -min -rise [get_ports nr]
set_input_delay 0 -min -fall [get_ports nr]
set_input_delay 0 -max -rise [get_ports nr]
set_input_delay 0 -max -fall [get_ports nr]
set_input_transition 5 -min -rise [get_ports nr]
set_input_transition 5 -min -fall [get_ports nr]
set_input_transition 5 -max -rise [get_ports nr]
set_input_transition 5 -max -fall [get_ports nr]
set_input_delay 0 -min -rise [get_ports nic0]
set_input_delay 0 -min -fall [get_ports nic0]
set_input_delay 0 -max -rise [get_ports nic0]
set_input_delay 0 -max -fall [get_ports nic0]
set_input_transition 5 -min -rise [get_ports nic0]
set_input_transition 5 -min -fall [get_ports nic0]
set_input_transition 5 -max -rise [get_ports nic0]
set_input_transition 5 -max -fall [get_ports nic0]
set_input_delay 0 -min -rise [get_ports nid1]
set_input_delay 0 -min -fall [get_ports nid1]
set_input_delay 0 -max -rise [get_ports nid1]
set_input_delay 0 -max -fall [get_ports nid1]
set_input_transition 5 -min -rise [get_ports nid1]
set_input_transition 5 -min -fall [get_ports nid1]
set_input_transition 5 -max -rise [get_ports nid1]
set_input_transition 5 -max -fall [get_ports nid1]
set_input_delay 0 -min -rise [get_ports nic4]
set_input_delay 0 -min -fall [get_ports nic4]
set_input_delay 0 -max -rise [get_ports nic4]
set_input_delay 0 -max -fall [get_ports nic4]
set_input_transition 5 -min -rise [get_ports nic4]
set_input_transition 5 -min -fall [get_ports nic4]
set_input_transition 5 -max -rise [get_ports nic4]
set_input_transition 5 -max -fall [get_ports nic4]
set_input_delay 0 -min -rise [get_ports nid10]
set_input_delay 0 -min -fall [get_ports nid10]
set_input_delay 0 -max -rise [get_ports nid10]
set_input_delay 0 -max -fall [get_ports nid10]
set_input_transition 5 -min -rise [get_ports nid10]
set_input_transition 5 -min -fall [get_ports nid10]
set_input_transition 5 -max -rise [get_ports nid10]
set_input_transition 5 -max -fall [get_ports nid10]
set_input_delay 0 -min -rise [get_ports nid31]
set_input_delay 0 -min -fall [get_ports nid31]
set_input_delay 0 -max -rise [get_ports nid31]
set_input_delay 0 -max -fall [get_ports nid31]
set_input_transition 5 -min -rise [get_ports nid31]
set_input_transition 5 -min -fall [get_ports nid31]
set_input_transition 5 -max -rise [get_ports nid31]
set_input_transition 5 -max -fall [get_ports nid31]
set_input_delay 0 -min -rise [get_ports nid3]
set_input_delay 0 -min -fall [get_ports nid3]
set_input_delay 0 -max -rise [get_ports nid3]
set_input_delay 0 -max -fall [get_ports nid3]
set_input_transition 5 -min -rise [get_ports nid3]
set_input_transition 5 -min -fall [get_ports nid3]
set_input_transition 5 -max -rise [get_ports nid3]
set_input_transition 5 -max -fall [get_ports nid3]
set_input_delay 0 -min -rise [get_ports nic1]
set_input_delay 0 -min -fall [get_ports nic1]
set_input_delay 0 -max -rise [get_ports nic1]
set_input_delay 0 -max -fall [get_ports nic1]
set_input_transition 5 -min -rise [get_ports nic1]
set_input_transition 5 -min -fall [get_ports nic1]
set_input_transition 5 -max -rise [get_ports nic1]
set_input_transition 5 -max -fall [get_ports nic1]
set_input_delay 0 -min -rise [get_ports nid22]
set_input_delay 0 -min -fall [get_ports nid22]
set_input_delay 0 -max -rise [get_ports nid22]
set_input_delay 0 -max -fall [get_ports nid22]
set_input_transition 5 -min -rise [get_ports nid22]
set_input_transition 5 -min -fall [get_ports nid22]
set_input_transition 5 -max -rise [get_ports nid22]
set_input_transition 5 -max -fall [get_ports nid22]
set_input_delay 0 -min -rise [get_ports nic3]
set_input_delay 0 -min -fall [get_ports nic3]
set_input_delay 0 -max -rise [get_ports nic3]
set_input_delay 0 -max -fall [get_ports nic3]
set_input_transition 5 -min -rise [get_ports nic3]
set_input_transition 5 -min -fall [get_ports nic3]
set_input_transition 5 -max -rise [get_ports nic3]
set_input_transition 5 -max -fall [get_ports nic3]
set_input_delay 0 -min -rise [get_ports nid26]
set_input_delay 0 -min -fall [get_ports nid26]
set_input_delay 0 -max -rise [get_ports nid26]
set_input_delay 0 -max -fall [get_ports nid26]
set_input_transition 5 -min -rise [get_ports nid26]
set_input_transition 5 -min -fall [get_ports nid26]
set_input_transition 5 -max -rise [get_ports nid26]
set_input_transition 5 -max -fall [get_ports nid26]
set_input_delay 0 -min -rise [get_ports nid23]
set_input_delay 0 -min -fall [get_ports nid23]
set_input_delay 0 -max -rise [get_ports nid23]
set_input_delay 0 -max -fall [get_ports nid23]
set_input_transition 5 -min -rise [get_ports nid23]
set_input_transition 5 -min -fall [get_ports nid23]
set_input_transition 5 -max -rise [get_ports nid23]
set_input_transition 5 -max -fall [get_ports nid23]
set_input_delay 0 -min -rise [get_ports nid16]
set_input_delay 0 -min -fall [get_ports nid16]
set_input_delay 0 -max -rise [get_ports nid16]
set_input_delay 0 -max -fall [get_ports nid16]
set_input_transition 5 -min -rise [get_ports nid16]
set_input_transition 5 -min -fall [get_ports nid16]
set_input_transition 5 -max -rise [get_ports nid16]
set_input_transition 5 -max -fall [get_ports nid16]
set_input_delay 0 -min -rise [get_ports nid17]
set_input_delay 0 -min -fall [get_ports nid17]
set_input_delay 0 -max -rise [get_ports nid17]
set_input_delay 0 -max -fall [get_ports nid17]
set_input_transition 5 -min -rise [get_ports nid17]
set_input_transition 5 -min -fall [get_ports nid17]
set_input_transition 5 -max -rise [get_ports nid17]
set_input_transition 5 -max -fall [get_ports nid17]
set_input_delay 0 -min -rise [get_ports nid27]
set_input_delay 0 -min -fall [get_ports nid27]
set_input_delay 0 -max -rise [get_ports nid27]
set_input_delay 0 -max -fall [get_ports nid27]
set_input_transition 5 -min -rise [get_ports nid27]
set_input_transition 5 -min -fall [get_ports nid27]
set_input_transition 5 -max -rise [get_ports nid27]
set_input_transition 5 -max -fall [get_ports nid27]
set_input_delay 0 -min -rise [get_ports nid9]
set_input_delay 0 -min -fall [get_ports nid9]
set_input_delay 0 -max -rise [get_ports nid9]
set_input_delay 0 -max -fall [get_ports nid9]
set_input_transition 5 -min -rise [get_ports nid9]
set_input_transition 5 -min -fall [get_ports nid9]
set_input_transition 5 -max -rise [get_ports nid9]
set_input_transition 5 -max -fall [get_ports nid9]
set_input_delay 0 -min -rise [get_ports nic2]
set_input_delay 0 -min -fall [get_ports nic2]
set_input_delay 0 -max -rise [get_ports nic2]
set_input_delay 0 -max -fall [get_ports nic2]
set_input_transition 5 -min -rise [get_ports nic2]
set_input_transition 5 -min -fall [get_ports nic2]
set_input_transition 5 -max -rise [get_ports nic2]
set_input_transition 5 -max -fall [get_ports nic2]
set_input_delay 0 -min -rise [get_ports nid7]
set_input_delay 0 -min -fall [get_ports nid7]
set_input_delay 0 -max -rise [get_ports nid7]
set_input_delay 0 -max -fall [get_ports nid7]
set_input_transition 5 -min -rise [get_ports nid7]
set_input_transition 5 -min -fall [get_ports nid7]
set_input_transition 5 -max -rise [get_ports nid7]
set_input_transition 5 -max -fall [get_ports nid7]
set_input_delay 0 -min -rise [get_ports nic5]
set_input_delay 0 -min -fall [get_ports nic5]
set_input_delay 0 -max -rise [get_ports nic5]
set_input_delay 0 -max -fall [get_ports nic5]
set_input_transition 5 -min -rise [get_ports nic5]
set_input_transition 5 -min -fall [get_ports nic5]
set_input_transition 5 -max -rise [get_ports nic5]
set_input_transition 5 -max -fall [get_ports nic5]
set_input_delay 0 -min -rise [get_ports nid30]
set_input_delay 0 -min -fall [get_ports nid30]
set_input_delay 0 -max -rise [get_ports nid30]
set_input_delay 0 -max -fall [get_ports nid30]
set_input_transition 5 -min -rise [get_ports nid30]
set_input_transition 5 -min -fall [get_ports nid30]
set_input_transition 5 -max -rise [get_ports nid30]
set_input_transition 5 -max -fall [get_ports nid30]
set_input_delay 0 -min -rise [get_ports nic6]
set_input_delay 0 -min -fall [get_ports nic6]
set_input_delay 0 -max -rise [get_ports nic6]
set_input_delay 0 -max -fall [get_ports nic6]
set_input_transition 5 -min -rise [get_ports nic6]
set_input_transition 5 -min -fall [get_ports nic6]
set_input_transition 5 -max -rise [get_ports nic6]
set_input_transition 5 -max -fall [get_ports nic6]
set_input_delay 0 -min -rise [get_ports nid14]
set_input_delay 0 -min -fall [get_ports nid14]
set_input_delay 0 -max -rise [get_ports nid14]
set_input_delay 0 -max -fall [get_ports nid14]
set_input_transition 5 -min -rise [get_ports nid14]
set_input_transition 5 -min -fall [get_ports nid14]
set_input_transition 5 -max -rise [get_ports nid14]
set_input_transition 5 -max -fall [get_ports nid14]
set_input_delay 0 -min -rise [get_ports nid29]
set_input_delay 0 -min -fall [get_ports nid29]
set_input_delay 0 -max -rise [get_ports nid29]
set_input_delay 0 -max -fall [get_ports nid29]
set_input_transition 5 -min -rise [get_ports nid29]
set_input_transition 5 -min -fall [get_ports nid29]
set_input_transition 5 -max -rise [get_ports nid29]
set_input_transition 5 -max -fall [get_ports nid29]
set_input_delay 0 -min -rise [get_ports nid8]
set_input_delay 0 -min -fall [get_ports nid8]
set_input_delay 0 -max -rise [get_ports nid8]
set_input_delay 0 -max -fall [get_ports nid8]
set_input_transition 5 -min -rise [get_ports nid8]
set_input_transition 5 -min -fall [get_ports nid8]
set_input_transition 5 -max -rise [get_ports nid8]
set_input_transition 5 -max -fall [get_ports nid8]
set_input_delay 0 -min -rise [get_ports nid12]
set_input_delay 0 -min -fall [get_ports nid12]
set_input_delay 0 -max -rise [get_ports nid12]
set_input_delay 0 -max -fall [get_ports nid12]
set_input_transition 5 -min -rise [get_ports nid12]
set_input_transition 5 -min -fall [get_ports nid12]
set_input_transition 5 -max -rise [get_ports nid12]
set_input_transition 5 -max -fall [get_ports nid12]
set_input_delay 0 -min -rise [get_ports nid5]
set_input_delay 0 -min -fall [get_ports nid5]
set_input_delay 0 -max -rise [get_ports nid5]
set_input_delay 0 -max -fall [get_ports nid5]
set_input_transition 5 -min -rise [get_ports nid5]
set_input_transition 5 -min -fall [get_ports nid5]
set_input_transition 5 -max -rise [get_ports nid5]
set_input_transition 5 -max -fall [get_ports nid5]
set_input_delay 0 -min -rise [get_ports nid15]
set_input_delay 0 -min -fall [get_ports nid15]
set_input_delay 0 -max -rise [get_ports nid15]
set_input_delay 0 -max -fall [get_ports nid15]
set_input_transition 5 -min -rise [get_ports nid15]
set_input_transition 5 -min -fall [get_ports nid15]
set_input_transition 5 -max -rise [get_ports nid15]
set_input_transition 5 -max -fall [get_ports nid15]
set_input_delay 0 -min -rise [get_ports nid25]
set_input_delay 0 -min -fall [get_ports nid25]
set_input_delay 0 -max -rise [get_ports nid25]
set_input_delay 0 -max -fall [get_ports nid25]
set_input_transition 5 -min -rise [get_ports nid25]
set_input_transition 5 -min -fall [get_ports nid25]
set_input_transition 5 -max -rise [get_ports nid25]
set_input_transition 5 -max -fall [get_ports nid25]
set_input_delay 0 -min -rise [get_ports nid18]
set_input_delay 0 -min -fall [get_ports nid18]
set_input_delay 0 -max -rise [get_ports nid18]
set_input_delay 0 -max -fall [get_ports nid18]
set_input_transition 5 -min -rise [get_ports nid18]
set_input_transition 5 -min -fall [get_ports nid18]
set_input_transition 5 -max -rise [get_ports nid18]
set_input_transition 5 -max -fall [get_ports nid18]
set_input_delay 0 -min -rise [get_ports nid28]
set_input_delay 0 -min -fall [get_ports nid28]
set_input_delay 0 -max -rise [get_ports nid28]
set_input_delay 0 -max -fall [get_ports nid28]
set_input_transition 5 -min -rise [get_ports nid28]
set_input_transition 5 -min -fall [get_ports nid28]
set_input_transition 5 -max -rise [get_ports nid28]
set_input_transition 5 -max -fall [get_ports nid28]
set_input_delay 0 -min -rise [get_ports nid24]
set_input_delay 0 -min -fall [get_ports nid24]
set_input_delay 0 -max -rise [get_ports nid24]
set_input_delay 0 -max -fall [get_ports nid24]
set_input_transition 5 -min -rise [get_ports nid24]
set_input_transition 5 -min -fall [get_ports nid24]
set_input_transition 5 -max -rise [get_ports nid24]
set_input_transition 5 -max -fall [get_ports nid24]
set_input_delay 0 -min -rise [get_ports nid4]
set_input_delay 0 -min -fall [get_ports nid4]
set_input_delay 0 -max -rise [get_ports nid4]
set_input_delay 0 -max -fall [get_ports nid4]
set_input_transition 5 -min -rise [get_ports nid4]
set_input_transition 5 -min -fall [get_ports nid4]
set_input_transition 5 -max -rise [get_ports nid4]
set_input_transition 5 -max -fall [get_ports nid4]
set_input_delay 0 -min -rise [get_ports nid19]
set_input_delay 0 -min -fall [get_ports nid19]
set_input_delay 0 -max -rise [get_ports nid19]
set_input_delay 0 -max -fall [get_ports nid19]
set_input_transition 5 -min -rise [get_ports nid19]
set_input_transition 5 -min -fall [get_ports nid19]
set_input_transition 5 -max -rise [get_ports nid19]
set_input_transition 5 -max -fall [get_ports nid19]
set_input_delay 0 -min -rise [get_ports nid2]
set_input_delay 0 -min -fall [get_ports nid2]
set_input_delay 0 -max -rise [get_ports nid2]
set_input_delay 0 -max -fall [get_ports nid2]
set_input_transition 5 -min -rise [get_ports nid2]
set_input_transition 5 -min -fall [get_ports nid2]
set_input_transition 5 -max -rise [get_ports nid2]
set_input_transition 5 -max -fall [get_ports nid2]
create_clock -period 100 -name virtual_clock
set_output_delay -9 -min -rise [get_ports nod24] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod24] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod24] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod24] -clock virtual_clock
set_load -pin_load 4 [get_ports nod24]
set_output_delay -9 -min -rise [get_ports nod6] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod6] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod6] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod6] -clock virtual_clock
set_load -pin_load 4 [get_ports nod6]
set_output_delay -9 -min -rise [get_ports nod23] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod23] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod23] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod23] -clock virtual_clock
set_load -pin_load 4 [get_ports nod23]
set_output_delay -9 -min -rise [get_ports nod31] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod31] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod31] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod31] -clock virtual_clock
set_load -pin_load 4 [get_ports nod31]
set_output_delay -9 -min -rise [get_ports nod14] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod14] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod14] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod14] -clock virtual_clock
set_load -pin_load 4 [get_ports nod14]
set_output_delay -9 -min -rise [get_ports nod11] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod11] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod11] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod11] -clock virtual_clock
set_load -pin_load 4 [get_ports nod11]
set_output_delay -9 -min -rise [get_ports nod19] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod19] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod19] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod19] -clock virtual_clock
set_load -pin_load 4 [get_ports nod19]
set_output_delay -9 -min -rise [get_ports nod28] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod28] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod28] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod28] -clock virtual_clock
set_load -pin_load 4 [get_ports nod28]
set_output_delay -9 -min -rise [get_ports nod12] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod12] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod12] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod12] -clock virtual_clock
set_load -pin_load 4 [get_ports nod12]
set_output_delay -9 -min -rise [get_ports nod5] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod5] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod5] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod5] -clock virtual_clock
set_load -pin_load 4 [get_ports nod5]
set_output_delay -9 -min -rise [get_ports nod13] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod13] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod13] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod13] -clock virtual_clock
set_load -pin_load 4 [get_ports nod13]
set_output_delay -9 -min -rise [get_ports nod3] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod3] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod3] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod3] -clock virtual_clock
set_load -pin_load 4 [get_ports nod3]
set_output_delay -9 -min -rise [get_ports nod21] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod21] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod21] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod21] -clock virtual_clock
set_load -pin_load 4 [get_ports nod21]
set_output_delay -9 -min -rise [get_ports nod29] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod29] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod29] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod29] -clock virtual_clock
set_load -pin_load 4 [get_ports nod29]
set_output_delay -9 -min -rise [get_ports nod1] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod1] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod1] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod1] -clock virtual_clock
set_load -pin_load 4 [get_ports nod1]
set_output_delay -9 -min -rise [get_ports nod7] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod7] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod7] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod7] -clock virtual_clock
set_load -pin_load 4 [get_ports nod7]
set_output_delay -9 -min -rise [get_ports nod17] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod17] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod17] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod17] -clock virtual_clock
set_load -pin_load 4 [get_ports nod17]
set_output_delay -9 -min -rise [get_ports nod30] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod30] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod30] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod30] -clock virtual_clock
set_load -pin_load 4 [get_ports nod30]
set_output_delay -9 -min -rise [get_ports nod18] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod18] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod18] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod18] -clock virtual_clock
set_load -pin_load 4 [get_ports nod18]
set_output_delay -9 -min -rise [get_ports nod4] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod4] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod4] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod4] -clock virtual_clock
set_load -pin_load 4 [get_ports nod4]
set_output_delay -9 -min -rise [get_ports nod10] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod10] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod10] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod10] -clock virtual_clock
set_load -pin_load 4 [get_ports nod10]
set_output_delay -9 -min -rise [get_ports nod15] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod15] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod15] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod15] -clock virtual_clock
set_load -pin_load 4 [get_ports nod15]
set_output_delay -9 -min -rise [get_ports nod0] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod0] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod0] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod0] -clock virtual_clock
set_load -pin_load 4 [get_ports nod0]
set_output_delay -9 -min -rise [get_ports nod16] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod16] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod16] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod16] -clock virtual_clock
set_load -pin_load 4 [get_ports nod16]
set_output_delay -9 -min -rise [get_ports nod20] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod20] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod20] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod20] -clock virtual_clock
set_load -pin_load 4 [get_ports nod20]
set_output_delay -9 -min -rise [get_ports nod27] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod27] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod27] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod27] -clock virtual_clock
set_load -pin_load 4 [get_ports nod27]
set_output_delay -9 -min -rise [get_ports nod2] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod2] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod2] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod2] -clock virtual_clock
set_load -pin_load 4 [get_ports nod2]
set_output_delay -9 -min -rise [get_ports nod9] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod9] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod9] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod9] -clock virtual_clock
set_load -pin_load 4 [get_ports nod9]
set_output_delay -9 -min -rise [get_ports nod25] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod25] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod25] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod25] -clock virtual_clock
set_load -pin_load 4 [get_ports nod25]
set_output_delay -9 -min -rise [get_ports nod8] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod8] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod8] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod8] -clock virtual_clock
set_load -pin_load 4 [get_ports nod8]
set_output_delay -9 -min -rise [get_ports nod26] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod26] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod26] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod26] -clock virtual_clock
set_load -pin_load 4 [get_ports nod26]
set_output_delay -9 -min -rise [get_ports nod22] -clock virtual_clock
set_output_delay -9 -min -fall [get_ports nod22] -clock virtual_clock
set_output_delay 89 -max -rise [get_ports nod22] -clock virtual_clock
set_output_delay 89 -max -fall [get_ports nod22] -clock virtual_clock
set_load -pin_load 4 [get_ports nod22]
