set_input_delay 0 -min -rise [get_ports nx1]
set_input_delay 0 -min -fall [get_ports nx1]
set_input_delay 0 -max -rise [get_ports nx1]
set_input_delay 0 -max -fall [get_ports nx1]
set_input_transition 5 -min -rise [get_ports nx1]
set_input_transition 5 -min -fall [get_ports nx1]
set_input_transition 5 -max -rise [get_ports nx1]
set_input_transition 5 -max -fall [get_ports nx1]
set_input_delay 0 -min -rise [get_ports nx7]
set_input_delay 0 -min -fall [get_ports nx7]
set_input_delay 0 -max -rise [get_ports nx7]
set_input_delay 0 -max -fall [get_ports nx7]
set_input_transition 5 -min -rise [get_ports nx7]
set_input_transition 5 -min -fall [get_ports nx7]
set_input_transition 5 -max -rise [get_ports nx7]
set_input_transition 5 -max -fall [get_ports nx7]
set_input_delay 0 -min -rise [get_ports nx3]
set_input_delay 0 -min -fall [get_ports nx3]
set_input_delay 0 -max -rise [get_ports nx3]
set_input_delay 0 -max -fall [get_ports nx3]
set_input_transition 5 -min -rise [get_ports nx3]
set_input_transition 5 -min -fall [get_ports nx3]
set_input_transition 5 -max -rise [get_ports nx3]
set_input_transition 5 -max -fall [get_ports nx3]
set_input_delay 0 -min -rise [get_ports nx2]
set_input_delay 0 -min -fall [get_ports nx2]
set_input_delay 0 -max -rise [get_ports nx2]
set_input_delay 0 -max -fall [get_ports nx2]
set_input_transition 5 -min -rise [get_ports nx2]
set_input_transition 5 -min -fall [get_ports nx2]
set_input_transition 5 -max -rise [get_ports nx2]
set_input_transition 5 -max -fall [get_ports nx2]
set_input_delay 0 -min -rise [get_ports nx6]
set_input_delay 0 -min -fall [get_ports nx6]
set_input_delay 0 -max -rise [get_ports nx6]
set_input_delay 0 -max -fall [get_ports nx6]
set_input_transition 5 -min -rise [get_ports nx6]
set_input_transition 5 -min -fall [get_ports nx6]
set_input_transition 5 -max -rise [get_ports nx6]
set_input_transition 5 -max -fall [get_ports nx6]
set_output_delay 9 -min -rise [get_ports nx23]
set_output_delay 9 -min -fall [get_ports nx23]
set_output_delay 11 -max -rise [get_ports nx23]
set_output_delay 11 -max -fall [get_ports nx23]
set_load -pin_load 4 [get_ports nx23]
set_output_delay 9 -min -rise [get_ports nx22]
set_output_delay 9 -min -fall [get_ports nx22]
set_output_delay 11 -max -rise [get_ports nx22]
set_output_delay 11 -max -fall [get_ports nx22]
set_load -pin_load 4 [get_ports nx22]
